# Задача 4. Модуль для проверки даты
# Создайте модуль и напишите в нём функцию, которая получает на вход дату в
# формате DD.MM.YYYY Функция возвращает истину, если дата может существовать
# или ложь, если такая дата невозможна. Для простоты договоримся, что год
# может быть в диапазоне [1, 9999]. Весь период (1 января 1 года - 31 декабря 9999
# года) действует Григорианский календарь. Проверку года на високосность
# вынести в отдельную защищённую функцию.
# Подсказка № 1
# Используйте метод split('.') для разделения строки даты на день, месяц и год.
# Преобразуйте каждую из частей в целые числа с помощью map(int, ...).
# Подсказка № 2
# Проверьте, что месяц находится в диапазоне от 1 до 12 включительно. Если нет, дата
# считается невалидной. Аналогично сделайте с годами и днями.
# Подсказка № 3
# Используйте datetime(year, month, day) для проверки корректности дaты

import checkdate

day = int(input('ведите дату: '))
mouth = int(input('ведите месяц: '))
yaer = int(input('ведите год: '))
print(checkdate.checkdate(day, mouth, yaer))