# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 


a = 10
b = 3.14
c = "Здарова отец"
d = [a, b, c]
e = {'test': a}
f = True

print(f"обьект {a} имеет тип, {type(a)}")
print(f"обьект {b} имеет тип, {type(b)}")
print(f"обьект {c} имеет тип, {type(c)}")
print(f"обьект {d} имеет тип, {type(d)}")
print(f"обьект {e} имеет тип, {type(e)}")
print(f"обьект {f} имеет тип, {type(f)}")