# Задача 3. Число наоборот
# Пользователь вводит два числа: N и K. Напишите программу, которая заменяет
# каждое число на число, которое получается из исходного записью его цифр в
# обратном порядке, затем складывает их, снова переворачивает и выводит
# ответ на экран.
# Пример:
# Введите первое число: 102
# Введите второе число: 123
# Первое число наоборот: 201
# Второе число наоборот: 321
# Сумма: 522
# Сумма наоборот: 225
# Подсказка № 1
# Функция reversal(x) должна обрабатывать каждую цифру числа, начиная с
# последней и добавляя её в новое число. Преобразование можно сделать, используя
# остаток от деления и целочисленное деление.
# Подсказка № 2
# В функции reversal(x) переменная count отслеживает количество цифр, а
# revers_x хранит перевёрнутое число. Не забудьте обновлять revers_x на каждой
# итерации.
# Подсказка № 3
# После ввода чисел и их переворачивания с помощью функции reversal, сложите
# перевёрнутые числа. Затем примените reversal к результату суммы, чтобы получить
# окончательный результат.



def reversal (num):
    reversed_num = 0
    while num > 0:
        digit = num % 10
        reversed_num = reversed_num * 10 + digit
        num //= 10
    return reversed_num

first_num = int(input("Введите первое число: "))
second_num = int(input("Введите второе число: "))
revers_first_num = reversal(first_num)
print(f'Первое число наоборот: {revers_first_num}')
revers_second_num = reversal(second_num)
print(f'Второе число наоборот: {revers_second_num}')
sum_num = revers_first_num + revers_second_num
print(f'Сумма: {sum_num}')
revers_sum = reversal(sum_num)
print(f'Сумма наоборот: {revers_sum}')