# Задание 1. Апгрейд калькулятора
# Степан использует калькулятор для расчёта суммы и разности чисел, но на
# работе ему требуются не только обычные арифметические действия. Он ничего
# не хочет делать вручную, поэтому решил немного расширить функционал
# калькулятора.
# Напишите программу, запрашивающую у пользователя число и действие,
# которое нужно сделать с числом: вывести сумму его цифр, максимальную или
# минимальную цифру. Каждое действие оформите в виде отдельной функции, а
# основную программу зациклите.
# Запрошенные числа должны передаваться в функции суммы, максимума и
# минимума при помощи аргументов.
# Подсказка № 1
# Создайте функцию для расчёта суммы цифр числа. В этой функции нужно
# использовать цикл, чтобы извлекать и суммировать каждую цифру числа. Не забудьте
# использовать оператор % для получения последней цифры и // для удаления
# последней цифры из числа.
# Подсказка № 2
# Создайте функцию для нахождения максимальной цифры числа. В этой функции также
# используйте цикл для извлечения и сравнения каждой цифры, чтобы определить
# максимальное значение.
# Подсказка № 3
# Создайте функцию для нахождения минимальной цифры числа. Начните с
# предположения, что минимальная цифра равна последней цифре числа. Сравните её
# с другими цифрами в цикле и обновите минимальное значение, если найдёте
# меньшую цифру.
# Подсказка № 4
# Создайте основной цикл программы, который будет запрашивать у пользователя число
# и действие. В зависимости от выбора действия (1, 2, 3), вызывайте соответствующую
# функцию для обработки числа.
def the_amount(num):
    '''Функция для поиска суммы цифр введенного числа'''
    summ = 0
    while num > 0:
        digit = num % 10
        summ += digit
        num //= 10
    print("Сумма чисел: ", summ)

def max_number(num):
    '''Функция для поиска максимальной цифры введенного числа'''
    maximal = 0
    while num > 0:
        digit = num % 10
        if digit > maximal:
            maximal = digit
        num //= 10
    print("Наибольшее число: ", maximal)

def min_number(num):
    '''Функция для поиска минимальной цифры введенного числа'''
    minimal = num % 10
    num //= 10 
    while num > 0:
        digit = num % 10
        if digit < minimal:
            minimal = digit
        num //= 10
    print("Наименьшее число: ", minimal)


def main(num, action):
    '''Функция выбора действия'''
    if action == 1:
        the_amount(num)
    elif action == 2:
        max_number(num)
        
    else:
        min_number(num)
        

while True:
    num = int(input('Введите число: '))
    action = int(input(f"Введите действие.\n1- сумма чисел;\n2- максимальная цифра;\n3- минимальная цифра.\n"))
    main(num, action)