# Задача 4. Функция максимума
# Юра пишет различные полезные функции для Python, чтобы остальным
# программистам стало проще работать. Он захотел написать функцию, которая
# будет находить максимум из перечисленных чисел. Функция для нахождения
# максимума из двух чисел у него уже есть. Юра задумался: может быть, её
# можно как-то использовать для нахождения максимума уже от трёх чисел?
# Помогите Юре написать программу, которая находит максимум из трёх чисел.
# Для этого используйте только функцию нахождения максимума из двух чисел.
# По итогу в программе должны быть реализованы две функции:
# 1. maximum_of_two — функция принимает два числа и возвращает одно
# (наибольшее из двух);
# 2. maximum_of_three — функция принимает три числа и возвращает одно
# (наибольшее из трёх); при этом она должна использовать для сравнений
# первую функцию maximum_of_two.
# Подсказка № 1
# Создайте функцию max_of_2, которая принимает два числа в качестве аргументов и
# возвращает большее из них. Используйте условный оператор if для сравнения двух
# чисел.
# Подсказка № 2
# Функция max_of_2 должна возвращать одно из двух чисел в зависимости от того,
# какое из них больше. Если первое число больше второго, то возвращайте первое
# число, иначе возвращайте второе.
# Подсказка № 3
# Для нахождения максимума из трёх чисел создайте функцию max_of_3. В этой
# функции вызовите функцию max_of_2 дважды: сначала для сравнения первых двух
# чисел, а затем для сравнения результата с третьим числом.
# Подсказка № 4
# В функции max_of_3 сначала получите максимум из двух чисел с помощью функции
# max_of_2. Затем сравните этот максимум с третьим числом, снова используя функцию
# max_of_2.

def maximum_of_two(a, b):
    if a > b:
        return a
    else:
        return b

def maximum_of_three(a, b, c):
    return maximum_of_two (maximum_of_two (a, b), c)

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))

print('Большее число: ', maximum_of_three(a, b, c))

