# Задача 3. Модуль для нахождения уникальных для обоих списков
# элементов
# Создайте модуль с функцией, которая принимает два списка и возвращает
# список, содержащий только элементы, которые уникальны для обоих списков.
# Подсказка № 1
# Преобразуйте оба списка в множества с помощью функции set(). Это позволит легко
# выполнять операции над уникальными элементами.
# Подсказка № 2
# Используйте операции над множествами для нахождения элементов, которые
# уникальны для каждого из множества. set1 - set2 даст элементы, которые
# присутствуют в set1, но отсутствуют в set2. Аналогично, set2 - set1 даст
# элементы, присутствующие в set2, но отсутствующие в set1.
# Подсказка № 3
# Объедините два результата (set1 - set2 и set2 - set1) с помощью операции |
# (объединение множеств), чтобы получить все уникальные элементы.
# Подсказка № 4
# Преобразуйте множество уникальных элементов обратно в список с помощью функции
# list(), чтобы вернуть результат в виде списка.

import uniquevalues

print(uniquevalues.unique_values([1, 2, 3], [3, 4, 5]))
