# Задание 1. Функцию группового переименования файлов.
# Напишите функцию группового переименования файлов. Она должна:
# 1. принимать параметр желаемое конечное имя файлов. При
# переименовании в конце имени добавляется порядковый номер.
# 2. принимать параметр количество цифр в порядковом номере.
# 3. принимать параметр расширение исходного файла. Переименование
# должно работать только для этих файлов внутри каталога.
# 4. принимать параметр расширение конечного файла.
# 5. принимать диапазон сохраняемого оригинального имени.
# Например для диапазона [3, 6] берутся буквы с 3 по 6 из исходного имени файла.
# К ним прибавляется желаемое конечное имя, если оно передано. Далее счётчик
# файлов и расширение. 3.Соберите из созданных на уроке и в рамках домашнего
# задания функций пакет для работы с файлами.
# Подсказка № 1
# Используйте функцию os.listdir() для получения всех файлов в указанном
# каталоге и фильтруйте их по расширению с помощью метода endswith().
# Подсказка № 2
# Для форматирования порядкового номера используйте форматную строку
# f"{{:0{num_digits}d}}", где num_digits определяет количество цифр в номере.
# Подсказка № 3
# Используйте срезы строки для извлечения нужной части базового имени файла в
# зависимости от диапазона. Помните, что индексы в Python начинаются с 0, поэтому
# корректируйте диапазон.
# Подсказка № 4
# Перед переименованием файлов убедитесь, что указанный каталог существует,
# используя функцию os.path.isdir(). Это предотвратит ошибки в случае неверного
# пути.
# Подсказка № 5
# Для переименования файлов используйте функцию os.rename(), передавая ей
# полные пути старого и нового имени файла. Убедитесь, что новые имена файлов
# формируются корректно, включая порядковый номер и расширение.

import os

def batch_rename_files(
    directory, target_name, num_digits, original_extension, new_extension, name_range
):
   
    if not os.path.isdir(directory):
        print(f"Каталог '{directory}' не найден.")
        return
    files = [f for f in os.listdir(directory) if f.endswith(original_extension)]
    files.sort()
    for index, filename in enumerate(files):
        base_name = os.path.splitext(filename)[0]
        start, end = name_range
        original_part = base_name[start:end]
        number = f"{index + 1:0{num_digits}d}"

        new_filename = f"{original_part}{target_name}{number}.{new_extension}"

        old_path = os.path.join(directory, filename)
        new_path = os.path.join(directory, new_filename)
        os.rename(old_path, new_path)

        print(f"'{filename}' переименован в '{new_filename}'")

batch_rename_files(
    directory="путь/к/каталогу",           
    target_name="Файл",                    
    num_digits=3,                          
    original_extension=".txt",             
    new_extension="csv",                   
    name_range=[3, 6]                      
)
