# Задача 5. Модуль для проверки ферзей
# Добавьте в пакет, созданный на семинаре шахматный модуль. Внутри него
# напишите код, решающий задачу о 8 ферзях. Известно, что на доске 8×8 можно
# расставить 8 ферзей так, чтобы они не били друг друга. Вам дана расстановка 8
# ферзей на доске, определите, есть ли среди них пара бьющих друг друга.
# Программа получает на вход восемь пар чисел, каждое число от 1 до 8 -
# координаты 8 ферзей. Если ферзи не бьют друг друга верните истину, а если бьют
# - ложь.
# Подсказка № 1
# Убедитесь, что ферзи не находятся в одной строке или столбце, так как это приведет к
# их атаке друг на друга. Для проверки можно использовать координаты столбца и
# строки каждого ферзя.
# Подсказка № 2
# Ферзи, находящиеся на одной диагонали, также будут атаковать друг друга. Проверьте,
# находятся ли ферзи на одной диагонали, используя разность между строками и
# столбцами.
# Подсказка № 3
# Напишите вспомогательную функцию внутри основной функции для проверки,
# находится ли конкретная позиция под атакой других ферзей. Это улучшит читаемость
# кода.
# Подсказка № 4
# Убедитесь, что каждая из 8 позиций на доске уникальна по строкам и столбцам. Это
# гарантирует, что нет двух ферзей в одной строке или столбце.


import sys
import chess

if len(sys.argv) != 9:
    print("Usage: python main.py row1 col1 row2 col2 ... row8 col8")
    sys.exit(1)

positions = [(int(sys.argv[i]), int(sys.argv[i+1])) for i in range(1, len(sys.argv), 2)]

if chess.are_queens_safe(positions):
    print("True")
else:
    print("False")
